In [1]:
import pandas as pd

In [8]:


df_orig = pd.read_csv('sales.csv')
df = df_orig.copy()

In [9]:
df

  Customer       Sales
0   rakesh         500
1     john  $1,000.00
2   suresh       300.1
3   manish    $750.01
4   deepak         300
5     Ritu    $250.00

In [10]:
df.dtypes

Customer    object
Sales       object
dtype: object

In [11]:
#To converts datatype of sales in float
df['Sales'].astype('float')

ValueError: could not convert string to float: '$1,000.00 '

In [6]:
#Try replace method  ==>inbuilt method of str class  str.replace('oldtext','newtext')

In [12]:
df['Sales'] = df['Sales'].str.replace(',', '')
df['Sales'] = df['Sales'].str.replace('$', '')
df['Sales']

0         500
1    1000.00
2       300.1
3     750.01
4         300
5     250.00
Name: Sales, dtype: object

In [ ]:
df['Sales'].astype('float')

In [13]:
df = df_orig.copy()
df['Sales'].apply(type)

0    <class 'str'>
1    <class 'str'>
2    <class 'str'>
3    <class 'str'>
4    <class 'str'>
5    <class 'str'>
Name: Sales, dtype: object

In [14]:
#To add new field in df
df['Sales_Type'] = df['Sales'].apply(lambda x: type(x).__name__)

In [15]:
df

  Customer       Sales Sales_Type
0   rakesh         500        str
1     john  $1,000.00         str
2   suresh       300.1        str
3   manish    $750.01         str
4   deepak         300        str
5     Ritu    $250.00         str

In [16]:
df['Sales'] = df['Sales'].str.replace(',', '')
df['Sales'] = df['Sales'].str.replace('$', '')
df['Sales']

0         500
1    1000.00
2       300.1
3     750.01
4         300
5     250.00
Name: Sales, dtype: object

In [18]:
#To add new field in df
df['Sales_Type'] = df['Sales'].apply(lambda x: type(x).__name__)
df

  Customer     Sales Sales_Type
0   rakesh       500        str
1     john  1000.00         str
2   suresh     300.1        str
3   manish   750.01         str
4   deepak       300        str
5     Ritu   250.00         str

In [19]:
#To converts datatype of sales in float
df['Sales'].astype('float')

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64

In [20]:
df['Sales'].apply(type).value_counts()

<class 'str'>    6
Name: Sales, dtype: int64

In [21]:
def clean_currency(x):  #user defined function 
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """
    if isinstance(x, str):
        return(x.replace('$', '').replace(',', ''))
    return(x)

In [22]:
df['Sales'] = df['Sales'].apply(clean_currency).astype('float')
df['Sales_Type'] = df['Sales'].apply(lambda x: type(x).__name__)

In [23]:
df

  Customer    Sales Sales_Type
0   rakesh   500.00      float
1     john  1000.00      float
2   suresh   300.10      float
3   manish   750.01      float
4   deepak   300.00      float
5     Ritu   250.00      float